In [1]:
import pandas as pd

In [68]:
data = pd.read_csv("http://tiny.cc/pandas_data", sep=";")

In [6]:
data = pd.read_csv("data.csv", sep=";")

In [ ]:
# pd.read_excel(...)

In [11]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Работа со столбцами и строками

In [12]:
type(data)

pandas.core.frame.DataFrame

In [13]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [15]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [51]:
data.values # numpy-array

array([[1, 0, 3, ..., nan, 'S', 4],
       [2, 1, 1, ..., 'C85', 'C', 2],
       [3, 1, 3, ..., nan, 'S', 4],
       ...,
       [889, 0, 3, ..., nan, 'S', 4],
       [890, 1, 1, ..., 'C148', 'C', 2],
       [891, 0, 3, ..., nan, 'Q', 4]], dtype=object)

In [24]:
data["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [18]:
type(data["Age"])

pandas.core.series.Series

In [38]:
data.Age # то же самое

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [22]:
data[["Age", "Pclass"]].head()
# .head() для демоснтрации результата в коротком виде

    Age  Pclass
0  22.0       3
1  38.0       1
2  26.0       3
3  35.0       1
4  35.0       3

Задача: Выделить все столбцы, кроме последнего

In [32]:
data2 = data[data.columns[:-1]]
data2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN

In [44]:
data.drop("Parch", axis=1, inplace=True)
# inplace удаляет в самом датафрейме

In [34]:
data.loc[3:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,Moran; Mr. James,unknown,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,McCarthy; Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,Palsson; Master. Gosta Leonard,male,2.0,3,1,349909,21.0750,NaN,S

In [35]:
data.loc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle; Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [36]:
data.loc[[2, 3, 9]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
9,10,1,2,Nasser; Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C

### Добавление новых данных

In [47]:
pd.concat([data.head(3), data.head(3)], axis=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [48]:
pd.concat([data.head(3), data.head(3)], axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,...,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,...,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,...,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [49]:
data["Pclass_plus_1"] = data["Pclass"] + 1

In [50]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_plus_1
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,4
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S,4

### Преобразования столбцов

In [52]:
data["Age"] / 100 # поэлементные операции

0      0.22
1      0.38
2      0.26
3      0.35
4      0.35
       ...
886    0.27
887    0.19
888     NaN
889    0.26
890    0.32
Name: Age, Length: 891, dtype: float64

In [53]:
data["Age"] * data["Pclass"]

0       66.0
1       38.0
2       78.0
3       35.0
4      105.0
       ...
886     54.0
887     19.0
888      NaN
889     26.0
890     96.0
Length: 891, dtype: float64

In [69]:
# перекодировать столбец
data["Sex"] = data["Sex"].map({"female":1, "male":-1, "unknown":0})

In [71]:
data["Sex"].head()

0   -1
1    1
2    1
3    1
4   -1
Name: Sex, dtype: int64

In [74]:
def process_age(x):
    if x < 30:
        return 1
    else:
        return 0
data["Age"].apply(process_age).head()

0    1
1    0
2    1
3    0
4    0
Name: Age, dtype: int64

In [77]:
data["Young"] = data["Age"].apply(lambda x: 1 if x < 30 else 0)

In [79]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Young
0,1,0,3,Braund; Mr. Owen Harris,-1,22.0,1,0,A/5 21171,7.25,NaN,S,1

Задача: создать столбец Family, содержащий фамилию - первое слово из Name
    
Задача: создать столбец TicketLength, хранящий длину номера билета. Усложнение: взять число цифр в билете, без букв

Задача: выполнить преобразование возраст в Young векторно без apply

In [81]:
# пример
s = "Braund; Mr. Owen Harris"
s.split(";")[0]

'Braund'

Решение 1

In [82]:
data["Family"] = data["Name"].apply(lambda s: s.split(";")[0])

In [84]:
def get_family(s):
    return s.split(";")[0]
data["Family"] = data["Name"].apply(get_family)

Решение 2

In [86]:
data["TicketLength"] = data["Ticket"].apply(lambda s: len(s))

Решение 3

In [95]:
data["Young"] = (data["Age"] < 30).astype(int)

In [96]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Young,Family,TicketLength
0,1,0,3,Braund; Mr. Owen Harris,-1,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,9
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,1,38.0,1,0,PC 17599,71.2833,C85,C,0,Cumings,8
2,3,1,3,Heikkinen; Miss. Laina,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Heikkinen,16
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),1,35.0,1,0,113803,53.1000,C123,S,0,Futrelle,6
4,5,0,3,Allen; Mr. William Henry,-1,35.0,0,0,373450,8.0500,NaN,S,0,Allen,6

### GroupBy

In [97]:
data["Age"].mean()

29.69911764705882

In [98]:
(data["Age"] < 30).mean()

0.43097643097643096

In [102]:
data.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [103]:
data.groupby("Pclass")["Fare"].sum()

Pclass
1    18177.4125
2     3801.8417
3     6714.6951
Name: Fare, dtype: float64

In [105]:
data.groupby("Pclass")["Fare"].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

In [106]:
data.groupby("Pclass")["Fare"].count()

Pclass
1    216
2    184
3    491
Name: Fare, dtype: int64

Задача: Сколько семей больше трех человек?
    
Задача: Сколько семей, в которых минимальный возраст меньше 10 лет?

Семья - люди с одинаковой фамилией

Решение 1

In [113]:
family_sizes = data.groupby("Family")["Name"].count()
(family_sizes > 3).sum()

22

Решение 2

In [119]:
min_ages = data.groupby("Family")["Age"].min()
(min_ages < 10).sum()

39

In [120]:
(min_ages >= 10)&(min_ages<=20)

Family
Abbing           False
Abbott            True
Abelson          False
Adahl            False
Adams            False
                 ...
de Mulder        False
de Pelsmaeker     True
del Carlo        False
van Billiard     False
van Melkebeke    False
Name: Age, Length: 667, dtype: bool

In [121]:
(min_ages < 10)|(min_ages>70)

Family
Abbing           False
Abbott           False
Abelson          False
Adahl            False
Adams            False
                 ...
de Mulder        False
de Pelsmaeker    False
del Carlo        False
van Billiard     False
van Melkebeke    False
Name: Age, Length: 667, dtype: bool

In [122]:
~(min_ages < 10)

Family
Abbing           True
Abbott           True
Abelson          True
Adahl            True
Adams            True
                 ...
de Mulder        True
de Pelsmaeker    True
del Carlo        True
van Billiard     True
van Melkebeke    True
Name: Age, Length: 667, dtype: bool

Summary

* Работа со строками и столбцами
* Анализ данных: агрегирующие операции (mean, sum, count, min, max ,...), поэлементные операции (< > + * ...), groupby! + еще будем знакомиться с полезными функциями в курсе
* Преобразование данных: поэлементные операции, map, apply + еще будем знакомиться с полезными функциями в курсе